//===========================================================================
//!
//!	@file		FuseVFXGraphDef.cs
//!	@brief		FuseVFXグラフ用定義
//!
//!	@author		Copyright (C) 2021 HEXADRIVE Inc. All rights reserved.
//!	@author		K.Fujihira
//!
//===========================================================================

namespace UnityEditor.VFX
{
	//===========================================================================
	//!	@class		FuseShaderGraphDef
	//!	@brief		FuseVFXグラフ用定義
	//===========================================================================
	static class FuseVFXGraphDef
	{
		//-----------------------------------------------------------
		//!	@name 定数
		//-----------------------------------------------------------
		//@{

		private const string	TEMPLATE_PATH			= "Packages/Fuse.HDRPExtend/Editor/VFXGraph/Shader/Template/";	//!< テンプレートフォルダへのパス

		//@}


		//-----------------------------------------------------------
		//!	@name 静的公開メソッド
		//-----------------------------------------------------------
		//@{

		//-----------------------------------------------------------
		//!	@brief	テンプレートファイルのパスを作成
		//!	@param	[in]	fileName	ファイル名
		//!	@return	パス
		//-----------------------------------------------------------
		public static string makeTemplatePath(string fileName)
		{
			return TEMPLATE_PATH + fileName;
		}

		//@}
	}
}
//===========================================================================
//	END OF FILE
//===========================================================================